Mixiaoxiao/Arduino-HomeKit-ESP8266/src/arduino_homekit_server.cpp
					json_string(json, (char*) encoded_data);

					free(encoded_data);
				}

				break;
			}
			}
		}

		if (!value && ch->getter_ex) {
			// called getter to get value, need to free it
			homekit_value_destruct(&v);
		}
	}
}
/*
struct tcp_pcb;
extern struct tcp_pcb* tcp_tw_pcbs;
extern "C" void tcp_abort (struct tcp_pcb* pcb);

void tcpCleanup (void) { //do not work???
  while (tcp_tw_pcbs)
    tcp_abort(tcp_tw_pcbs);
}*/

void write(client_context_t *context, byte *data, int data_size) {
	if (context == nullptr || context->socket == nullptr) {
		CLIENT_ERROR(context, "The socket is null! (or is closed)");
		return;
	}
	if (context->error_write){
		CLIENT_ERROR(context, "error_in_write_data is true, abort write data");
		return;
	}
	int write_size = context->socket->write(data, data_size);
	/*
	bool flush_ok = context->socket->flush(HOMEKIT_SOCKET_FLUSH_WAIT_MS);
	//不需要flush，Sync=true的时候都是同步发送数据的
	if (!flush_ok){
		context->error_write = true;
		context->socket->keepAlive(1, 1, 1);
		CLIENT_ERROR(context, "socket.flush timeout, maybe disconnected. data_size=%d", data_size);
		return;
	}*/
	int availableForWrite = context->socket->availableForWrite();
	CLIENT_DEBUG(context, "socket.write, data_size=%d, write_size=%d, availableForWrite=%d, WriteError=%d",
			data_size, write_size, availableForWrite, context->socket->getWriteError());
	//sync=true时，如果write在没有发送成功，会造成内存泄漏
	if (write_size != data_size) {
		//猜测Socket对方已断开，本sockek缓冲区满了，如果这时候断开连接会造成内存泄漏
		//所以最终的方案是由自身的keepalive来定disconnect
		//context->socket->stop(); // Causes memory leak if some data has not been sent (eg. the peer client is disconnected)
		// A workaround to stop the socket and free the internal write_buffer (memory leak)
		// If just call socket.stop(), the write_buffer will not free
		context->error_write = true;
		context->socket->keepAlive(1, 1, 1);// fast disconnected internally in 1 second.

		CLIENT_ERROR(context, "socket.write, data_size=%d, write_size=%d", data_size, write_size);
		//if (write_size == 0) {
			//如果没有发送成功数据就认为该socket已断开
			//实测，iPhone断开WiFi之后，ESP8266发送数据write_size=0，
			//但connected返回值仍为true
			//context->disconnect = true;
			//homekit_server_close_client(context->server, context);
			//return;
		//}
	}

}

int client_send_encrypted_(client_context_t *context,
byte *payload, size_t size) {
	CLIENT_DEBUG(context, "client_send_encrypted_ size=%d", size);
	if (!context || !context->encrypted)
		return -1;

	byte nonce[12];
	memset(nonce, 0, sizeof(nonce));

	byte encrypted[1024 + 18];
	int payload_offset = 0;

	while (payload_offset < size) {
		size_t chunk_size = size - payload_offset;
		if (chunk_size > 1024)
			chunk_size = 1024;

		byte aead[2] = { chunk_size % 256, chunk_size / 256 };

		memcpy(encrypted, aead, 2);

		byte i = 4;
		int x = context->count_reads++;
		while (x) {
			nonce[i++] = x % 256;
			x /= 256;
		}

		size_t available = sizeof(encrypted) - 2;
		int r = crypto_chacha20poly1305_encrypt(context->read_key, nonce, aead, 2,
				payload + payload_offset, chunk_size, encrypted + 2, &available);
		if (r) {
			ERROR("Failed to chacha encrypt payload (code %d)", r);
			return -1;
		}

		payload_offset += chunk_size;

		write(context, encrypted, available + 2);
	}

	return 0;
}

int client_decrypt_(client_context_t *context,
byte *payload, size_t payload_size, byte *decrypted, size_t *decrypted_size) {
	if (!context || !context->encrypted)
		return -1;

	const size_t block_size = 1024 + 16 + 2;
	size_t required_decrypted_size = payload_size / block_size * 1024;
	if (payload_size % block_size > 0)
		required_decrypted_size += payload_size % block_size - 16 - 2;

	if (*decrypted_size < required_decrypted_size) {
		*decrypted_size = required_decrypted_size;
		return -2;
	}

	*decrypted_size = required_decrypted_size;

	byte nonce[12];
	memset(nonce, 0, sizeof(nonce));

	int payload_offset = 0;
	int decrypted_offset = 0;

	while (payload_offset < payload_size) {
		size_t chunk_size = payload[payload_offset] + payload[payload_offset + 1] * 256;
		if (chunk_size + 18 > payload_size - payload_offset) {
			// Unfinished chunk
			break;
		}

		byte i = 4;
		int x = context->count_writes++;
		while (x) {
			nonce[i++] = x % 256;
			x /= 256;
		}

		size_t decrypted_len = *decrypted_size - decrypted_offset;
		int r = crypto_chacha20poly1305_decrypt(context->write_key, nonce, payload + payload_offset,
				2, payload + payload_offset + 2, chunk_size + 16, decrypted, &decrypted_len);
		if (r) {
			ERROR("Failed to chacha decrypt payload (code %d)", r);
			return -1;
		}

		decrypted_offset += decrypted_len;
		payload_offset += chunk_size + 18;
	}

	return payload_offset;
}

//将设备的notify事件（如各种状态改变存起来）
void client_notify_characteristic(homekit_characteristic_t *ch, homekit_value_t value,
		void *context) {
	client_context_t *client = (client_context_t*) context;

	if (client->current_characteristic == ch && client->current_value
			&& homekit_value_equal(client->current_value, &value)){
		// This value is set by this client, no need to send notification
		CLIENT_DEBUG(client, "This value is set by this client, no need to send notification");
		return;
	}
	CLIENT_INFO(client, "Got characteristic %d.%d change event",
			ch->service->accessory->id, ch->id);
	//DEBUG("Got characteristic %d.%d change event", ch->service->accessory->id, ch->id);

	if (!client->event_queue) {
		ERROR("Client has no event queue. Skipping notification");
		return;
	}

	characteristic_event_t *event = (characteristic_event_t*) malloc(
			sizeof(characteristic_event_t));
	event->characteristic = ch;
	homekit_value_copy(&event->value, &value);

	DEBUG("Sending event to client %d", client->socket);

	//xQueueSendToBack(client->event_queue, &event, 10);*/
	//client->event_queue->add(event);
	//q_push第二个参数要传指针地址
	q_push(client->event_queue, &event);
}

void client_send(client_context_t *context, byte *data, size_t data_size) {
//#if HOMEKIT_DEBUG
//    if (data_size < 4096) {
//        char *payload = binary_to_string(data, data_size);
//        CLIENT_DEBUG(context, "Sending payload: %s", payload);
//        free(payload);
//    }
//#endif

